ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/QSPI_1.0.xml
    <register id="QSPI_QSPICTL0" width="32" offset="0x1200" description="QSPI Control-0 register">
        <bitfield id="QSPIDUMMYCLK" description="The bits provides the number of dummy clocks to insert during a flash read operation" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Largest possible value"/>
        </bitfield>
        <bitfield id="QSPIDSIZE" description="The register bits provide the packing and unpacking option from the FIFO to the flash interface" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="_8BITDSIZE" value="0x0" description="Sets 8-bit data write and read from FIFO"/>
            <bitenum id="_16BITDSIZE" value="0x2" description="Sets 16-bit data write and read from FIFO"/>
            <bitenum id="_32BITDSIZE" value="0x3" description="Sets 32-bit data write and read from FIFO"/>
        </bitfield>
        <bitfield id="QSPICMDBYTE" description="The register bits provide the instruction opcode to be used during a flash read" begin="15" end="8" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Largest value"/>
        </bitfield>
        <bitfield id="QSPIPERFBYTE" description="The register bits provide the performance byte to be used during a flash read" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Samllest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Largest value"/>
        </bitfield>
        <bitfield id="QSPIFORMAT" description="The bits provides the bus format to be used" begin="27" end="24" width="4" rwaccess="R/W">
            <bitenum id="LEGACY_SPI_FULLDUPLEX" value="0x0" description="Legacy SPI format full-duplex"/>
            <bitenum id="SPI_HALFDUPLEX" value="0x1" description="SPI format half-duplex when not sending a data read frame"/>
            <bitenum id="QPI_HALF_DUPLEX" value="0x2" description="QPI format half-duplex when not sending a data read frame"/>
            <bitenum id="SSS_MODE" value="0x8" description="SSS format when sending a data read frame"/>
            <bitenum id="SSD_MODE" value="0x9" description="SSD format when sending a data read frame"/>
            <bitenum id="SDD_MODE" value="0xA" description="SDD format when sending a data read frame"/>
            <bitenum id="SSQ_MODE" value="0xB" description="SSQ format when sending a data read frame"/>
            <bitenum id="SQQ_MODE" value="0xC" description="SQQ format when sending a data read frame"/>
            <bitenum id="QQQ_MODE" value="0xD" description="QQQ format when sending a data read frame"/>
        </bitfield>
        <bitfield id="QSPIADDRMODE" description="The bit field sets the number of address byte to be used for communication with QSPI flash during a data read" begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="_3BYTE_ADDR" value="0x0" description="Use 3-byte address"/>
            <bitenum id="_4BYTE_ADDR" value="0x1" description="Use 4-byte address"/>
        </bitfield>
        <bitfield id="QSPIPERFMODE" description="This bit enables or disables the performance mode byte insertion" begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Performance mode is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Performance mode is enabled"/>
        </bitfield>
        <bitfield id="QSPIMODE" description="This bits selects which port is used for QSPI memory access" begin="31" end="31" width="1" rwaccess="R">
            <bitenum id="PERIPH_PORT" value="0x0" description="Selects peripheral port for external flash access"/>
            <bitenum id="DIRECT_PORT" value="0x1" description="Selects direct port for external flash access"/>
        </bitfield>
    </register>
    <register id="QSPI_QSPICTL1" width="32" offset="0x1204" description="QSPI Control-1 Register">
        <bitfield id="TXCOUNT" description="" begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="QSPIPREFETCH" description="Controls prefetch of data when the read transaction is started" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Prefetch is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Prefetch is enabled"/>
        </bitfield>
        <bitfield id="RXCOUNT" description="" begin="23" end="16" width="8" rwaccess="R/W">
            <bitenum id="RXFIFOMON" value="0x0" description="Only RXFIFO full level is monitored."/>
            <bitenum id="MINIMUM" value="0x1" description="Smalles possible value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="QSPI_QSPITIMING" width="32" offset="0x1208" description="The register is controls the timing setting for chip select assertion and de-assertion with respect to the serial clock, sampling delay for the data and chip-select behavior in performance mode">
        <bitfield id="CSDEASSERTDLY" description="When in QSPI mode the bit controls the number of serial clock edge after last SCLK to deassert the chip select" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="_0P5SCLKDELAY" value="0x0" description="Chip select is deasserted 0.5 internal SCLK after last edge of the external SCLK"/>
            <bitenum id="_1P5SCLKDELAY" value="0x1" description="Chip select is deasserted 1.5 internal SCLK after last edge of the external SCLK"/>
        </bitfield>
        <bitfield id="CSASSERTDLY" description="When in QSPI mode the bit controls the number of serial clock edge after chip select is asserted to start the SCLK" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="_0P5SCLKDELAY" value="0x0" description="SCLK is started 0.5 internal SCLK after CS is asserted"/>
            <bitenum id="_1P5SCLKDELAY" value="0x1" description="SCLK is started 1.5 internal SCLK after CS is asserted"/>
        </bitfield>
        <bitfield id="DATASAMPLDLY" description="When in QSPI mode, controls the sampling of the received data" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="NODELAY" value="0x0" description="Received data is sampled on the rising edge of SCLK"/>
            <bitenum id="_1CLKDELAY" value="0x1" description="Received data is delayed by 1 SCLK before being sampled"/>
        </bitfield>
        <bitfield id="CSHIGHTIME" description="When in performance mode, the parameter provides the number of bus clocks for which the CS shgall be high when an address change is detected" begin="23" end="16" width="8" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFF" description="Largest value"/>
        </bitfield>
    </register>
    <register id="QSPI_QSPIFIFOCTL" width="32" offset="0x120C" description="The register controls the flush operation in the peripheral FIFO">
        <bitfield id="RXFIFOFLUSH" description="The bit is used to reset the RXFIFO pointers to flush any data from the preceding transaction." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOEFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLEAR" value="0x1" description="Resets the RXFIFO and any corresponding status bit. The field will be auto-cleared after RXFIFO is reset"/>
        </bitfield>
        <bitfield id="TXFIFOFLUSH" description="The bit is used to reset the TXFIFO pointers to flush any data from the preceding transaction." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NOEFFECT" value="0x0" description="No effect"/>
            <bitenum id="CLEAR" value="0x1" description="Resets the TXFIFO and any corresponding status bit. The field will be auto-cleared after TXFIFO is reset"/>
        </bitfield>
    </register>
    <register id="QSPI_QSPICSCTL" width="32" offset="0x1210" description="The register controls the toggling of chip select">
        <bitfield id="CSHOLDCTL" description="Controls the chip select hold feature during an active transaction when QSPIFORMAT is not 0x0" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="NOEFFECT" value="0x0" description="No effect"/>
            <bitenum id="DEASSERT" value="0x1" description="When written as 1, causes the chip select to be deasserted after the current bus transaction is completed"/>
        </bitfield>
    </register>
