ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/QSPI_1.0.xml
    <register id="QSPI_QSPIDMACTL" width="32" offset="0x1220" description="The register is used to generate a soft trigger for the DMA">
        <bitfield id="DMATRIG" description="" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DMATRIG_NOEFFECT" value="0x0" description="Writing the bit as 0 has no effect"/>
            <bitenum id="DMATRIG_ENABLE" value="0x1" description="Writing this bit as 1 asserts a DMA request"/>
        </bitfield>
    </register>
    <register id="QSPI_QSPISTATUS" width="32" offset="0x1234" description="The register contains the status bits for the QSPI controller and the FIFO">
        <bitfield id="RXFIFOE" description="Receive FIFO status empty status" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="RXFIFOE_NE" value="0x0" description="Receive FIFO is not empty"/>
            <bitenum id="RXFIFOE_E" value="0x1" description="Receive FIFO is empty"/>
        </bitfield>
        <bitfield id="RXFIFONF" description="Receive FIFO not full status" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="RXFIFONF_F" value="0x0" description="Receive FIFO is full"/>
            <bitenum id="RXFIFONF_NF" value="0x1" description="Receive FIFO is not full"/>
        </bitfield>
        <bitfield id="TXFIFOE" description="Transmit FIFO empty status" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="TXFIFOE_NE" value="0x0" description="Transmit FIFO is not empty"/>
            <bitenum id="TXFIFOE_E" value="0x1" description="Transmit FIFO is empty"/>
        </bitfield>
        <bitfield id="TXFIFONF" description="Transmit FIFO not full status" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="TXFIFONF_F" value="0x0" description="Transmit FIFO is full"/>
            <bitenum id="TXFIFONF_NF" value="0x1" description="Transmit FIFO is not full"/>
        </bitfield>
        <bitfield id="QSPISTALL" description="The bit indicates the state of the QSPI controller during an active transaction" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="QSPISTALL_ACTIVE" value="0x0" description="The QSPI is sending or receiving data bytes from the memory"/>
            <bitenum id="QSPISTALL_STALL" value="0x1" description="The QSPI is currently stalled on the TXFIFO empty to have data or RXFIFO empty to have space to receive data"/>
        </bitfield>
        <bitfield id="QSPIIDLE" description="Provides the state of the QSPI controller" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="QSPIIDLE_ACT" value="0x0" description="The QSPI has an active transaction ongoing or stalled and the chip select is low"/>
            <bitenum id="QSPIIDLE_IDLE" value="0x1" description="The QSPI does not have an active transaction and the chip select is high"/>
        </bitfield>
    </register>

</module>